cmsis-svd/cmsis-svd/data/Nuvoton/NANO112AN_v1.svd
       <register>
          <name>GPIOA_PIN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GPIOA_PIN</displayName>
          <description>GPIO Port A Pin Value Register</description>
          <addressOffset>0x10</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF0000</resetMask>
          <fields>
            <field>
              <name>PIN0</name>
              <description>GPIO Port [X] Pin [N] Value\nThe value read from each of these bit reflects the actual status of the respective GPI/O pin\nNote: For GPIOE_PIN, bits [15:10] are reserved.\nFor GPIOF_PIN, bits [15:6] are reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PIN1</name>
              <description>GPIO Port [X] Pin [N] Value\nThe value read from each of these bit reflects the actual status of the respective GPI/O pin\nNote: For GPIOE_PIN, bits [15:10] are reserved.\nFor GPIOF_PIN, bits [15:6] are reserved.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PIN2</name>
              <description>GPIO Port [X] Pin [N] Value\nThe value read from each of these bit reflects the actual status of the respective GPI/O pin\nNote: For GPIOE_PIN, bits [15:10] are reserved.\nFor GPIOF_PIN, bits [15:6] are reserved.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PIN3</name>
              <description>GPIO Port [X] Pin [N] Value\nThe value read from each of these bit reflects the actual status of the respective GPI/O pin\nNote: For GPIOE_PIN, bits [15:10] are reserved.\nFor GPIOF_PIN, bits [15:6] are reserved.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PIN4</name>
              <description>GPIO Port [X] Pin [N] Value\nThe value read from each of these bit reflects the actual status of the respective GPI/O pin\nNote: For GPIOE_PIN, bits [15:10] are reserved.\nFor GPIOF_PIN, bits [15:6] are reserved.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PIN5</name>
              <description>GPIO Port [X] Pin [N] Value\nThe value read from each of these bit reflects the actual status of the respective GPI/O pin\nNote: For GPIOE_PIN, bits [15:10] are reserved.\nFor GPIOF_PIN, bits [15:6] are reserved.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PIN6</name>
              <description>GPIO Port [X] Pin [N] Value\nThe value read from each of these bit reflects the actual status of the respective GPI/O pin\nNote: For GPIOE_PIN, bits [15:10] are reserved.\nFor GPIOF_PIN, bits [15:6] are reserved.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PIN7</name>
              <description>GPIO Port [X] Pin [N] Value\nThe value read from each of these bit reflects the actual status of the respective GPI/O pin\nNote: For GPIOE_PIN, bits [15:10] are reserved.\nFor GPIOF_PIN, bits [15:6] are reserved.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PIN8</name>
              <description>GPIO Port [X] Pin [N] Value\nThe value read from each of these bit reflects the actual status of the respective GPI/O pin\nNote: For GPIOE_PIN, bits [15:10] are reserved.\nFor GPIOF_PIN, bits [15:6] are reserved.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PIN9</name>
              <description>GPIO Port [X] Pin [N] Value\nThe value read from each of these bit reflects the actual status of the respective GPI/O pin\nNote: For GPIOE_PIN, bits [15:10] are reserved.\nFor GPIOF_PIN, bits [15:6] are reserved.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PIN10</name>
              <description>GPIO Port [X] Pin [N] Value\nThe value read from each of these bit reflects the actual status of the respective GPI/O pin\nNote: For GPIOE_PIN, bits [15:10] are reserved.\nFor GPIOF_PIN, bits [15:6] are reserved.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PIN11</name>
              <description>GPIO Port [X] Pin [N] Value\nThe value read from each of these bit reflects the actual status of the respective GPI/O pin\nNote: For GPIOE_PIN, bits [15:10] are reserved.\nFor GPIOF_PIN, bits [15:6] are reserved.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PIN12</name>
              <description>GPIO Port [X] Pin [N] Value\nThe value read from each of these bit reflects the actual status of the respective GPI/O pin\nNote: For GPIOE_PIN, bits [15:10] are reserved.\nFor GPIOF_PIN, bits [15:6] are reserved.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PIN13</name>
              <description>GPIO Port [X] Pin [N] Value\nThe value read from each of these bit reflects the actual status of the respective GPI/O pin\nNote: For GPIOE_PIN, bits [15:10] are reserved.\nFor GPIOF_PIN, bits [15:6] are reserved.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PIN14</name>
              <description>GPIO Port [X] Pin [N] Value\nThe value read from each of these bit reflects the actual status of the respective GPI/O pin\nNote: For GPIOE_PIN, bits [15:10] are reserved.\nFor GPIOF_PIN, bits [15:6] are reserved.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PIN15</name>
              <description>GPIO Port [X] Pin [N] Value\nThe value read from each of these bit reflects the actual status of the respective GPI/O pin\nNote: For GPIOE_PIN, bits [15:10] are reserved.\nFor GPIOF_PIN, bits [15:6] are reserved.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
