cmsis-svd/cmsis-svd/data/Nuvoton/NANO112AN_v1.svd
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RIER1</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable by Input Rising Edge or Input Level High\nRIER[x] used to enable the interrupt for each of the corresponding input GPIO_PIN[x]. Set bit "1" also enable the pin wake-up function \nWhen set the RIER[x] bit "1":\nIf the interrupt is level mode trigger, the input PIN[x] state at level "high" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[x] state change from "low-to-high" will generate the interrupt.\nNote: For GPIOE_IE, bits [31:26] are reserved.\nFor GPIOF_IE, bits [31:22] are reserved.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[x] level-high or low-to-high interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[x] level-high or low-to-high interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RIER2</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable by Input Rising Edge or Input Level High\nRIER[x] used to enable the interrupt for each of the corresponding input GPIO_PIN[x]. Set bit "1" also enable the pin wake-up function \nWhen set the RIER[x] bit "1":\nIf the interrupt is level mode trigger, the input PIN[x] state at level "high" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[x] state change from "low-to-high" will generate the interrupt.\nNote: For GPIOE_IE, bits [31:26] are reserved.\nFor GPIOF_IE, bits [31:22] are reserved.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[x] level-high or low-to-high interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[x] level-high or low-to-high interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RIER3</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable by Input Rising Edge or Input Level High\nRIER[x] used to enable the interrupt for each of the corresponding input GPIO_PIN[x]. Set bit "1" also enable the pin wake-up function \nWhen set the RIER[x] bit "1":\nIf the interrupt is level mode trigger, the input PIN[x] state at level "high" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[x] state change from "low-to-high" will generate the interrupt.\nNote: For GPIOE_IE, bits [31:26] are reserved.\nFor GPIOF_IE, bits [31:22] are reserved.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[x] level-high or low-to-high interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[x] level-high or low-to-high interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RIER4</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable by Input Rising Edge or Input Level High\nRIER[x] used to enable the interrupt for each of the corresponding input GPIO_PIN[x]. Set bit "1" also enable the pin wake-up function \nWhen set the RIER[x] bit "1":\nIf the interrupt is level mode trigger, the input PIN[x] state at level "high" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[x] state change from "low-to-high" will generate the interrupt.\nNote: For GPIOE_IE, bits [31:26] are reserved.\nFor GPIOF_IE, bits [31:22] are reserved.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[x] level-high or low-to-high interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[x] level-high or low-to-high interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RIER5</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable by Input Rising Edge or Input Level High\nRIER[x] used to enable the interrupt for each of the corresponding input GPIO_PIN[x]. Set bit "1" also enable the pin wake-up function \nWhen set the RIER[x] bit "1":\nIf the interrupt is level mode trigger, the input PIN[x] state at level "high" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[x] state change from "low-to-high" will generate the interrupt.\nNote: For GPIOE_IE, bits [31:26] are reserved.\nFor GPIOF_IE, bits [31:22] are reserved.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[x] level-high or low-to-high interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[x] level-high or low-to-high interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RIER6</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable by Input Rising Edge or Input Level High\nRIER[x] used to enable the interrupt for each of the corresponding input GPIO_PIN[x]. Set bit "1" also enable the pin wake-up function \nWhen set the RIER[x] bit "1":\nIf the interrupt is level mode trigger, the input PIN[x] state at level "high" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[x] state change from "low-to-high" will generate the interrupt.\nNote: For GPIOE_IE, bits [31:26] are reserved.\nFor GPIOF_IE, bits [31:22] are reserved.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[x] level-high or low-to-high interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[x] level-high or low-to-high interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RIER7</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable by Input Rising Edge or Input Level High\nRIER[x] used to enable the interrupt for each of the corresponding input GPIO_PIN[x]. Set bit "1" also enable the pin wake-up function \nWhen set the RIER[x] bit "1":\nIf the interrupt is level mode trigger, the input PIN[x] state at level "high" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[x] state change from "low-to-high" will generate the interrupt.\nNote: For GPIOE_IE, bits [31:26] are reserved.\nFor GPIOF_IE, bits [31:22] are reserved.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[x] level-high or low-to-high interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[x] level-high or low-to-high interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RIER8</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable by Input Rising Edge or Input Level High\nRIER[x] used to enable the interrupt for each of the corresponding input GPIO_PIN[x]. Set bit "1" also enable the pin wake-up function \nWhen set the RIER[x] bit "1":\nIf the interrupt is level mode trigger, the input PIN[x] state at level "high" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[x] state change from "low-to-high" will generate the interrupt.\nNote: For GPIOE_IE, bits [31:26] are reserved.\nFor GPIOF_IE, bits [31:22] are reserved.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[x] level-high or low-to-high interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[x] level-high or low-to-high interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RIER9</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable by Input Rising Edge or Input Level High\nRIER[x] used to enable the interrupt for each of the corresponding input GPIO_PIN[x]. Set bit "1" also enable the pin wake-up function \nWhen set the RIER[x] bit "1":\nIf the interrupt is level mode trigger, the input PIN[x] state at level "high" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[x] state change from "low-to-high" will generate the interrupt.\nNote: For GPIOE_IE, bits [31:26] are reserved.\nFor GPIOF_IE, bits [31:22] are reserved.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[x] level-high or low-to-high interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[x] level-high or low-to-high interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RIER10</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable by Input Rising Edge or Input Level High\nRIER[x] used to enable the interrupt for each of the corresponding input GPIO_PIN[x]. Set bit "1" also enable the pin wake-up function \nWhen set the RIER[x] bit "1":\nIf the interrupt is level mode trigger, the input PIN[x] state at level "high" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[x] state change from "low-to-high" will generate the interrupt.\nNote: For GPIOE_IE, bits [31:26] are reserved.\nFor GPIOF_IE, bits [31:22] are reserved.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[x] level-high or low-to-high interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[x] level-high or low-to-high interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RIER11</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable by Input Rising Edge or Input Level High\nRIER[x] used to enable the interrupt for each of the corresponding input GPIO_PIN[x]. Set bit "1" also enable the pin wake-up function \nWhen set the RIER[x] bit "1":\nIf the interrupt is level mode trigger, the input PIN[x] state at level "high" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[x] state change from "low-to-high" will generate the interrupt.\nNote: For GPIOE_IE, bits [31:26] are reserved.\nFor GPIOF_IE, bits [31:22] are reserved.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[x] level-high or low-to-high interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[x] level-high or low-to-high interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RIER12</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable by Input Rising Edge or Input Level High\nRIER[x] used to enable the interrupt for each of the corresponding input GPIO_PIN[x]. Set bit "1" also enable the pin wake-up function \nWhen set the RIER[x] bit "1":\nIf the interrupt is level mode trigger, the input PIN[x] state at level "high" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[x] state change from "low-to-high" will generate the interrupt.\nNote: For GPIOE_IE, bits [31:26] are reserved.\nFor GPIOF_IE, bits [31:22] are reserved.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[x] level-high or low-to-high interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[x] level-high or low-to-high interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RIER13</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable by Input Rising Edge or Input Level High\nRIER[x] used to enable the interrupt for each of the corresponding input GPIO_PIN[x]. Set bit "1" also enable the pin wake-up function \nWhen set the RIER[x] bit "1":\nIf the interrupt is level mode trigger, the input PIN[x] state at level "high" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[x] state change from "low-to-high" will generate the interrupt.\nNote: For GPIOE_IE, bits [31:26] are reserved.\nFor GPIOF_IE, bits [31:22] are reserved.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[x] level-high or low-to-high interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[x] level-high or low-to-high interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RIER14</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable by Input Rising Edge or Input Level High\nRIER[x] used to enable the interrupt for each of the corresponding input GPIO_PIN[x]. Set bit "1" also enable the pin wake-up function \nWhen set the RIER[x] bit "1":\nIf the interrupt is level mode trigger, the input PIN[x] state at level "high" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[x] state change from "low-to-high" will generate the interrupt.\nNote: For GPIOE_IE, bits [31:26] are reserved.\nFor GPIOF_IE, bits [31:22] are reserved.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[x] level-high or low-to-high interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[x] level-high or low-to-high interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RIER15</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable by Input Rising Edge or Input Level High\nRIER[x] used to enable the interrupt for each of the corresponding input GPIO_PIN[x]. Set bit "1" also enable the pin wake-up function \nWhen set the RIER[x] bit "1":\nIf the interrupt is level mode trigger, the input PIN[x] state at level "high" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[x] state change from "low-to-high" will generate the interrupt.\nNote: For GPIOE_IE, bits [31:26] are reserved.\nFor GPIOF_IE, bits [31:22] are reserved.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[x] level-high or low-to-high interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[x] level-high or low-to-high interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
