cmsis-svd/cmsis-svd/data/Nuvoton/NANO112AN_v1.svd
       <register derivedFrom="PWM_CRL0">
          <name>PWM_CRL1</name>
          <displayName>PWM_CRL1</displayName>
          <description>Capture Rising Latch Register (Channel 1)</description>
          <addressOffset>0x68</addressOffset>
       </register>
       <register derivedFrom="PWM_CFL0">
          <name>PWM_CFL1</name>
          <displayName>PWM_CFL1</displayName>
          <description>Capture Falling Latch Register (Channel 1)</description>
          <addressOffset>0x6C</addressOffset>
       </register>
       <register derivedFrom="PWM_CRL0">
          <name>PWM_CRL2</name>
          <displayName>PWM_CRL2</displayName>
          <description>Capture Rising Latch Register (Channel 2)</description>
          <addressOffset>0x70</addressOffset>
       </register>
       <register derivedFrom="PWM_CFL0">
          <name>PWM_CFL2</name>
          <displayName>PWM_CFL2</displayName>
          <description>Capture Falling Latch Register (Channel 2)</description>
          <addressOffset>0x74</addressOffset>
       </register>
       <register derivedFrom="PWM_CRL0">
          <name>PWM_CRL3</name>
          <displayName>PWM_CRL3</displayName>
          <description>Capture Rising Latch Register (Channel 3)</description>
          <addressOffset>0x78</addressOffset>
       </register>
       <register derivedFrom="PWM_CFL0">
          <name>PWM_CFL3</name>
          <displayName>PWM_CFL3</displayName>
          <description>Capture Falling Latch Register (Channel 3)</description>
          <addressOffset>0x7C</addressOffset>
       </register>
       <register>
          <name>PWM_PDMACH0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PWM_PDMACH0</displayName>
          <description>PDMA Channel 0 Captured Data</description>
          <addressOffset>0x80</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDMACH01</name>
              <description>Captured Data of Channel 0\nWhen CH01CASK is disabled, this byte is 0\nWhen CH01CASK is enabled, It is the 1st byte of 32 bit capturing data for channel 0.\nNote: This register is used as a buffer to transfer PWM captured rising or falling data to memory by PDMA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PDMACH02</name>
              <description>Captured Data of Channel 0\nWhen CH01CASK is disabled, this byte is 0\nWhen CH01CASK is enabled, It is the 2nd byte of 32 bit capturing data for channel 0.\nNote: This register is used as a buffer to transfer PWM captured rising or falling data to memory by PDMA.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PDMACH03</name>
              <description>Captured Data of Channel 0\nWhen CH01CASK is disabled, this byte is 0\nWhen CH01CASK is enabled, It is the 3rd byte of 32 bit capturing data for channel 0.\nNote: This register is used as a buffer to transfer PWM captured rising or falling data to memory by PDMA.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PDMACH04</name>
              <description>Captured Data of Channel 0\nWhen CH01CASK is disabled, this byte is 0\nWhen CH01CASK is enabled, It is the 4th byte of 32 bit capturing data for channel 0.\nNote: This register is used as a buffer to transfer PWM captured rising or falling data to memory by PDMA.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PWM_PDMACH2</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PWM_PDMACH2</displayName>
          <description>PDMA Channel 2 Captured Data</description>
          <addressOffset>0x84</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDMACH21</name>
              <description>Captured Data of Channel 2\nWhen CH23CASK is disabled, this byte is 0\nWhen CH23CASK is enabled, It is the 1st byte of 32 bit capturing data for channel 0.\nNote: This register is used as a buffer to transfer PWM captured rising or falling data to memory by PDMA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PDMACH22</name>
              <description>Captured Data of Channel 2\nWhen CH23CASK is disabled, this byte is 0\nWhen CH23CASK is enabled, It is the 2nd byte of 32 bit capturing data for channel 0.\nNote: This register is used as a buffer to transfer PWM captured rising or falling data to memory by PDMA.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PDMACH23</name>
              <description>Captured Data of Channel 2\nWhen CH23CASK is disabled, this byte is 0\nWhen CH23CASK is enabled, It is the 3rd byte of 32 bit capturing data for channel 0.\nNote: This register is used as a buffer to transfer PWM captured rising or falling data to memory by PDMA.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PDMACH24</name>
              <description>Captured Data of Channel 2\nWhen CH23CASK is disabled, this byte is 0\nWhen CH23CASK is enabled, It is the 4th byte of 32 bit capturing data for channel 0.\nNote: This register is used as a buffer to transfer PWM captured rising or falling data to memory by PDMA.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PWM_ADTRGEN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PWM_ADTRGEN</displayName>
          <description>PWM Center-triggered Control Register</description>
          <addressOffset>0x88</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRGCH0EN</name>
              <description>PWM CH0 Center-triggered Enable Control\nNote: The center-triggered function is only valid in PWM center-aligned mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PWM CH0 center-triggered function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PWM CH0 center-triggered function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGCH1EN</name>
              <description>PWM CH1 Center-triggered Enable Control\nNote: The center-triggered function is only valid in PWM center-aligned mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PWM CH1 center-triggered function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PWM CH1 center-triggered function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGCH2EN</name>
              <description>PWM CH2 Center-triggered Enable Control\nNote: The center-triggered function is only valid in PWM center-aligned mode.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PWM CH2 center-triggered function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PWM CH2 center-triggered function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGCH3EN</name>
              <description>PWM CH3 Center-triggered Enable Control\nNote: The center-triggered function is only valid in PWM center-aligned mode.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PWM CH3 center-triggered function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PWM CH3 center-triggered function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PWM_ADTRGSTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PWM_ADTRGSTS</displayName>
          <description>PWM Center-triggered Indication Register</description>
          <addressOffset>0x8C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADTRG0Flag</name>
              <description>PWM CH0 Center-triggered Flag\nNote: This flag is only valid in center-aligned mode, and software could write 1 into this bit to clear the flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PWM CH0 has not crossed half of PWM period yet</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PWM CH0 has crossed half of PWM period</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>ADTRG1Flag</name>
              <description>PWM CH1 Center-triggered Flag\nNote: This flag is only valid in center-aligned mode, and software could write 1 into this bit to clear the flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PWM CH1 has not crossed half of PWM period yet</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PWM CH1 has crossed half of PWM period</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>ADTRG2Flag</name>
              <description>PWM CH2 Center-triggered Flag\nNote: This flag is only valid in center-aligned mode, and software could write 1 into this bit to clear the flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PWM CH2 has not crossed half of PWM period yet</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PWM CH2 has crossed half of PWM period</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>ADTRG3Flag</name>
              <description>PWM CH3 Center-triggered Flag\nNote: This flag is only valid in center-aligned mode, and software could write 1 into this bit to clear the flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PWM CH3 has not crossed half of PWM period yet</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PWM CH3 has crossed half of PWM period</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
